# 2. (8 ქულა) Დაწერეთ პროგრამა რომელიც მოხმარებელს მოსთხოვს შეიყვანოს მთელი რიცხვი n, სადაც 10 <= n <= 5432. 
# Თუ მომხმარებელი შეიყვანს არასწორ რიცხვს ეკრანზე დაბეჭდეთ რომ პროგრამას გადმოეცა არასწორი რიცხვი და 
# შეწყვიტეთ პროგრამის მუშაობა. Თუ მომხმარებელი შეიყვანს სწორ რიცხვს, პროგრამამ უნდა იპოვოს ყველა 13 ის ჯერადი რიცხვი 1-დან n-მდე.
# Ეკრანზე დაბეჭდოს ეს რიცხვები და მათი საერთო რაოდენობა.


n = int(input("Enter Number from 10 to 5432: "))
count = 0
# count += 1
if n >= 10 and n <= 5432:
    for i in range(1,n):
        if i % 13 == 0:
            print(i)
            count += 1
    print(f"count of jeradi: {count}")
else:
    print("wrong number")

        
